Tekla Open API Reference for Tekla Structures 2025
CurvedDimensionRadial Constructor
Overload List
Name | Description
CurvedDimensionRadial(ViewBase, Point, Point, Point, Point, Point, Double)
 Creates a new curved dimension with radial reference points using standard attributes.
CurvedDimensionRadial(ViewBase, Point, Point, Point, Point, Point, Double, CurvedDimensionSetRadial.CurvedDimensionSetRadialAttributes)
 Creates a new curved dimension with radial reference points.
Top
See Also
Reference
CurvedDimensionRadial Class
Tekla.Structures.Drawing Namespace